luc-github/MySafeFob/boards/x4pro/factory/sdkconfig.defaults
# MySafeFob Factory — sdkconfig (ADR-007)
# MANDATORY: the factory erases the otadata backup @0xB000 (before the 1st
# partition @0xD000); with CONFIG_SPI_FLASH_DANGEROUS_WRITE's default of
# ABORTS, this access abort()s.

CONFIG_IDF_TARGET="esp32s3"
# DIAG 2026-09-14: DIO — cf. root sdkconfig.defaults (QIO = TG0WDT boot loop
# observed on this unit; DIO = the probe's validated config).
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Native USB-Serial/JTAG console (same reason as the root) + DEBUG logs
# for boot-loop diagnostics.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

# The factory boots from the "factory" partition — same table as the app.
# Relative path from boards/<board>/factory/ to boards/<board>/partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y
